In [2]:
import numpy as np
import pandas as pd

In [8]:
ave_data = np.array(np.arange(25)).reshape((5,5))
dates = pd.date_range('20220101', periods=5)
ave_df = pd.DataFrame(ave_data, index=dates, columns=list('12345'))
ave_df

             1   2   3   4   5
2022-01-01   0   1   2   3   4
2022-01-02   5   6   7   8   9
2022-01-03  10  11  12  13  14
2022-01-04  15  16  17  18  19
2022-01-05  20  21  22  23  24

In [10]:
laptops = ['Macbook', 'Dell', 'HP', 'Xiomi', 'Monster']
laptops_df = pd.DataFrame({
    'price':[2500, 1200, 1400, 1350, 1800],
    'disc_space':[8, 2, 3, 3, 5]},
    index=laptops)
laptops_df

         price  disc_space
Macbook   2500           8
Dell      1200           2
HP        1400           3
Xiomi     1350           3
Monster   1800           5

In [11]:
more_laptops =['Macbook', 'Sony', 'HP', 'Xiomi', 'Toshiba']
laptops_df_2 =laptops_df.reindex(more_laptops)
laptops_df_2

          price  disc_space
Macbook  2500.0         8.0
Sony        NaN         NaN
HP       1400.0         3.0
Xiomi    1350.0         3.0
Toshiba     NaN         NaN

In [12]:
laptops_df_3 = laptops_df_2.dropna(how='any')
laptops_df_3

          price  disc_space
Macbook  2500.0         8.0
HP       1400.0         3.0
Xiomi    1350.0         3.0

In [13]:
laptops_df_2.fillna(value=1500)

          price  disc_space
Macbook  2500.0         8.0
Sony     1500.0      1500.0
HP       1400.0         3.0
Xiomi    1350.0         3.0
Toshiba  1500.0      1500.0

In [14]:
pd.isnull(laptops_df_2)

         price  disc_space
Macbook  False       False
Sony      True        True
HP       False       False
Xiomi    False       False
Toshiba   True        True

In [15]:
laptops_df_2 * 10

           price  disc_space
Macbook  25000.0        80.0
Sony         NaN         NaN
HP       14000.0        30.0
Xiomi    13500.0        30.0
Toshiba      NaN         NaN

### stats

In [16]:
pd.set_option('display.precision', 2)
laptops_df_2.describe()

        price  disc_space
count     3.0        3.00
mean   1750.0        4.67
std     650.0        2.89
min    1350.0        3.00
25%    1375.0        3.00
50%    1400.0        3.00
75%    1950.0        5.50
max    2500.0        8.00

In [17]:
laptops_df_2.mean()

price         1750.00
disc_space       4.67
dtype: float64

In [18]:
laptops_df_2.mean(1)

Macbook    1254.0
Sony          NaN
HP          701.5
Xiomi       676.5
Toshiba       NaN
dtype: float64

In [19]:
laptops_df_2.apply(np.cumsum, axis=0)

          price  disc_space
Macbook  2500.0         8.0
Sony        NaN         NaN
HP       3900.0        11.0
Xiomi    5250.0        14.0
Toshiba     NaN         NaN

In [20]:
pieces = [laptops_df_2[:1], laptops_df_2[1:3], laptops_df_2[3:]]
pieces

[          price  disc_space
 Macbook  2500.0         8.0,
        price  disc_space
 Sony     NaN         NaN
 HP    1400.0         3.0,
           price  disc_space
 Xiomi    1350.0         3.0
 Toshiba     NaN         NaN]

In [21]:
new_list = pieces[0], pieces[2]
pd.concat(new_list)

          price  disc_space
Macbook  2500.0         8.0
Xiomi    1350.0         3.0
Toshiba     NaN         NaN

In [22]:
new_last_row = laptops_df_2.iloc[2]

In [23]:
laptops_df_2.append(new_last_row)

          price  disc_space
Macbook  2500.0         8.0
Sony        NaN         NaN
HP       1400.0         3.0
Xiomi    1350.0         3.0
Toshiba     NaN         NaN
HP       1400.0         3.0

In [24]:
left = pd.DataFrame({'my_key':['K0', 'K1', 'K2', 'K3'],
                    'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2','B3']})
right = pd.DataFrame({'my_key':['K0', 'K1', 'K2', 'K3'],
                     'C':['C0', 'C1', 'C2', 'C3'],
                     'D':['D0', 'D1', 'D2', 'D3']})

In [25]:
result = pd.merge(left, right, on='my_key')
result

  my_key   A   B   C   D
0     K0  A0  B0  C0  D0
1     K1  A1  B1  C1  D1
2     K2  A2  B2  C2  D2
3     K3  A3  B3  C3  D3